//描述
//将浮点数转换为整数类型，要求四舍五入。
//输入描述：
//随机输入的浮点数
//输出描述：
//四舍五入之后的整数
//示例1
//输入：
//14.99
//
//输出：
//15

//#include<stdio.h>
//int main()
//{
//	double n = 0;
//	scanf_s("%lf", &n);
//	printf("%.0lf", n);
//	return 0;
//}

//描述
//依次输入一个学生的学号，以及3科（C语言，数学，英语）成绩，在屏幕上输出该学生的学号，3科成绩（注：输出成绩时需进行四舍五入且保留2位小数）。
//
//数据范围：学号满足
//
//1≤n≤20000000  ，各科成绩使用百分制，且不可能出现负数
//输入描述：
//学号以及3科成绩，学号和成绩之间用英文分号隔开，成绩之间用英文逗号隔开。
//输出描述：
//学号，3科成绩，输出格式详见输出样例。
//示例1
//输入：
//17140216; 80.845, 90.55, 100.00
//复制
//输出：
//The each subject score of No. 17140216 is 80.85, 90.55, 100.00.
//
//示例2
//输入：
//123456; 93.33, 99.99, 81.20
//
//输出：
//The each subject score of No. 123456 is 93.33, 99.99, 81.20.

